class StoreData:
    def __init__(self):
        self.category=["case", 'switch', 'keycap', 'pcb', 'plate', 'stabilizer', 'foam']  # 1, 2, 3, 4, 5, 6, 7
    
        self.detail={
            1:['60%', '65%', '75%', '80%', '100%', 'case-etc'],  # 8, 9, 10, 11, 12, 13
            2:['linear', 'tactile', 'low-noise', 'magnetic'],  # 14, 15, 16, 17
            3:['double-shot', 'dye-sub', 'artisan', 'cap-etc'],  # 18, 19, 20, 21
            6:['pcb-mount', 'plate-mount'],  # 22, 23
        }
        
        self.swegkey_list=["스위치", "키보드", "키캡", "기판 & 파츠", "스테빌라이저", "툴"]
        
        # 만약 1~3 사이 숫자가 들어있다면, 제목/설명 기반으로 카테고리 추출 - 쉑키는 설명(_1enCFJskWo)에, 지온은 처음부터 분류됨
        self.swegkey_dic={
            "스위치":[["마그네틱 스위치", 17], ["저소음", 16], ["리니어", 14], ["택타일", 15]],
            "키보드":[["Swagkeys", 1], ["Owlab", 9], ["QK", 1], ["Neo", 1], ["MatrixLab", 13], ["MODE", 9], ["Angrymiao", 9], ["Whatever Studio", 11], ["Omnitype", 9], ["TKD", 1], ["FoxLab", 9], ["Cannonkeys", 10]],
            # 분류가 붙으면 그대로 넣고, 안붙은거는 제목에서 가져가기
            "키캡":[["SW", 3],["FBB", 3],["Keyreative", 3],["Hammerworks", 3],["DMK", 3],["MilkyWay", 3],["GMK", 3],["JKDK",3],["JTK", 3],["아티산", 20],["기타 키캡", 3]],
            # sweg 키캡은 상품 설명에서 분류 가져오기
            "기판 & 파츠":[["기판", 4], ["보강판", 5]],
            "스테빌라이저":[["무보강용(PCB)", 22], ["보강용(Plate)", 23]],
            "툴":[["필름", 7], ["흡음재", 7]]
        } # 있으면 넣지 않음
        
        self.housing={
            '60':8,
            '65':9,
            '75':10,
            '80':11,
            '100':12,
            '101':12,
            '트랜지션':11,
            'Cycle':11,
            'MINI':8,
            'TKL':11
        }
        
        self.geon_list=["VENOM", "PCB & 보강판", "키보드", "스위치", "스테빌라이저", "키캡", "흡음재"]
    
        self.geon_dic={
            "VENOM":[['케이스', 1], ['기판', 4], ['보강판', 5]],  # 각자 카테고리로 넣기
            "PCB & 보강판":[['PCB', 4], ['보강판', 5]],
            "키보드":[['Margo65', 9], ['MAGNUM65', 9], ['TIGER F13', 11], ['FROG TKL', 11], ['DUNE 65', 9]],
            "스위치":False,  # 이름에서 카테고리 추출하기 => "자석축", "저소음", "리니어", "넌클릭" 순
            "스테빌라이저":[["PCB(무보강)용", 22], ["보강용", 23]],
            "키캡":[['이중사출', 18], ['염료승화', 19], ['금속 아티산', 20], ['기타', 21]],
            "흡음재":False
        }
        
        self.geon_category={"스위치":2, "흡음재":7}
        
        self.geon_switch=['자석축', '저소음', '리니어', '넌클릭']
        
        self.geon_mapping={
            '자석축':17,
            '저소음':16,
            '리니어':14,
            '넌클릭':15
        }
        self.geon_remove=['스템', '스프링', '폼', '와셔', '디퓨저'] # 이름으로 제거
        
        self.keycap={
            '염료승화':19,
            '이중사출':18,
            '아티산':20
        }